/* automatically generated by rust-bindgen 0.68.1 */

#[doc = "! Represents a symbol.\n!\n! This includes numbers, strings, functions (including constants when\n! arguments are empty and tuples when the name is empty), <tt>\\#inf</tt> and <tt>\\#sup</tt>."]
pub type clingo_symbol_t = u64;
// #[repr(C)]
// #[derive(Debug, Copy, Clone)]
// pub struct clingo_statistic {
//     _unused: [u8; 0],
// }
// #[doc = "! Handle for the solver statistics."]
// pub type clingo_statistics_t = clingo_statistic;
// #[repr(C)]
// #[derive(Debug, Copy, Clone)]
// pub struct clingo_model {
//     _unused: [u8; 0],
// }
// #[doc = "! Object representing a model."]
// pub type clingo_model_t = clingo_model;
// #[repr(C)]
// #[derive(Debug, Copy, Clone)]
// pub struct clingo_control {
//     _unused: [u8; 0],
// }
// #[doc = "! Control object holding grounding and solving state."]
// pub type clingo_control_t = clingo_control;
// #[repr(C)]
// #[derive(Debug, Copy, Clone)]
// pub struct clingo_ast {
//     _unused: [u8; 0],
// }
// #[doc = "! This struct provides a view to nodes in the AST."]
// pub type clingo_ast_t = clingo_ast;
// #[repr(C)]
// #[derive(Debug, Copy, Clone)]
// pub struct clingo_options {
//     _unused: [u8; 0],
// }
// #[doc = "! Object to add command-line options."]
// pub type clingo_options_t = clingo_options;
#[doc = "! Corresponding type to ::clingcon_value_type."]
pub type clingcon_value_type_t = ::std::os::raw::c_int;
#[doc = "! Struct to store values that can be returned by a theory."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct clingcon_value {
    pub type_: clingcon_value_type_t,
    pub __bindgen_anon_1: clingcon_value__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union clingcon_value__bindgen_ty_1 {
    pub int_number: ::std::os::raw::c_int,
    pub double_number: f64,
    pub symbol: clingo_symbol_t,
}
#[test]
fn bindgen_test_layout_clingcon_value__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<clingcon_value__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<clingcon_value__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(clingcon_value__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<clingcon_value__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(clingcon_value__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).int_number) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(clingcon_value__bindgen_ty_1),
            "::",
            stringify!(int_number)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).double_number) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(clingcon_value__bindgen_ty_1),
            "::",
            stringify!(double_number)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).symbol) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(clingcon_value__bindgen_ty_1),
            "::",
            stringify!(symbol)
        )
    );
}
#[test]
fn bindgen_test_layout_clingcon_value() {
    const UNINIT: ::std::mem::MaybeUninit<clingcon_value> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<clingcon_value>(),
        16usize,
        concat!("Size of: ", stringify!(clingcon_value))
    );
    assert_eq!(
        ::std::mem::align_of::<clingcon_value>(),
        8usize,
        concat!("Alignment of ", stringify!(clingcon_value))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(clingcon_value),
            "::",
            stringify!(type_)
        )
    );
}
#[doc = "! Struct to store values that can be returned by a theory."]
pub type clingcon_value_t = clingcon_value;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct clingcon_theory {
    _unused: [u8; 0],
}
#[doc = "! The clingcon theory."]
pub type clingcon_theory_t = clingcon_theory;
#[doc = "! Callback to rewrite statements (see ::clingcon_rewrite_ast)."]
pub type clingcon_ast_callback_t = ::std::option::Option<
    unsafe extern "C" fn(ast: *mut clingo_ast_t, data: *mut ::std::os::raw::c_void) -> bool,
>;
extern "C" {
    #[doc = "! Creates the theory."]
    pub fn clingcon_create(theory: *mut *mut clingcon_theory_t) -> bool;
}
extern "C" {
    #[doc = "! Register the theory with a control object."]
    pub fn clingcon_register(
        theory: *mut clingcon_theory_t,
        control: *mut clingo_control_t,
    ) -> bool;
}
extern "C" {
    #[doc = "! Rewrite asts before adding them via the given callback."]
    pub fn clingcon_rewrite_ast(
        theory: *mut clingcon_theory_t,
        ast: *mut clingo_ast_t,
        add: clingcon_ast_callback_t,
        data: *mut ::std::os::raw::c_void,
    ) -> bool;
}
extern "C" {
    #[doc = "! Prepare the theory between grounding and solving."]
    pub fn clingcon_prepare(theory: *mut clingcon_theory_t, control: *mut clingo_control_t)
        -> bool;
}
extern "C" {
    #[doc = "! Destroy the theory.\n!\n! Currently no way to unregister a theory."]
    pub fn clingcon_destroy(theory: *mut clingcon_theory_t) -> bool;
}
extern "C" {
    #[doc = "! Configure theory manually (without using clingo's options facility).\n!\n! Note that the theory has to be configured before registering it and cannot\n! be reconfigured."]
    pub fn clingcon_configure(
        theory: *mut clingcon_theory_t,
        key: *const ::std::os::raw::c_char,
        value: *const ::std::os::raw::c_char,
    ) -> bool;
}
extern "C" {
    #[doc = "! Register options of the theory."]
    pub fn clingcon_register_options(
        theory: *mut clingcon_theory_t,
        options: *mut clingo_options_t,
    ) -> bool;
}
extern "C" {
    #[doc = "! Validate options of the theory."]
    pub fn clingcon_validate_options(theory: *mut clingcon_theory_t) -> bool;
}
extern "C" {
    #[doc = "! Callback for models."]
    pub fn clingcon_on_model(theory: *mut clingcon_theory_t, model: *mut clingo_model_t) -> bool;
}
extern "C" {
    #[doc = "! Obtain a symbol index which can be used to get the value of a symbol.\n!\n! Returns true if the symbol exists.\n! Does not throw."]
    pub fn clingcon_lookup_symbol(
        theory: *mut clingcon_theory_t,
        symbol: clingo_symbol_t,
        index: *mut usize,
    ) -> bool;
}
extern "C" {
    #[doc = "! Obtain the symbol at the given index.\n!\n! Does not throw."]
    pub fn clingcon_get_symbol(theory: *mut clingcon_theory_t, index: usize) -> clingo_symbol_t;
}
extern "C" {
    #[doc = "! Initialize index so that it can be used with clingcon_assignment_next.\n!\n! Does not throw."]
    pub fn clingcon_assignment_begin(
        theory: *mut clingcon_theory_t,
        thread_id: u32,
        index: *mut usize,
    );
}
extern "C" {
    #[doc = "! Move to the next index that has a value.\n!\n! Returns true if the updated index is valid.\n! Does not throw."]
    pub fn clingcon_assignment_next(
        theory: *mut clingcon_theory_t,
        thread_id: u32,
        index: *mut usize,
    ) -> bool;
}
extern "C" {
    #[doc = "! Check if the symbol at the given index has a value.\n!\n! Does not throw."]
    pub fn clingcon_assignment_has_value(
        theory: *mut clingcon_theory_t,
        thread_id: u32,
        index: usize,
    ) -> bool;
}
extern "C" {
    #[doc = "! Get the symbol and it's value at the given index.\n!\n! Does not throw."]
    pub fn clingcon_assignment_get_value(
        theory: *mut clingcon_theory_t,
        thread_id: u32,
        index: usize,
        value: *mut clingcon_value_t,
    );
}
extern "C" {
    #[doc = "! Callback for statistic updates.\n!\n! Best add statistics under a subkey with the name of your theory."]
    pub fn clingcon_on_statistics(
        theory: *mut clingcon_theory_t,
        step: *mut clingo_statistics_t,
        accu: *mut clingo_statistics_t,
    ) -> bool;
}
